InformationRegisters/ШкалаСтавокНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ШкалаСтавокНалогов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяНалоговойДекларации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаПолная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПорога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиШкалыСтавокНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСФондамиПоСтраховымВзносам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСФондамиПоСтраховымВзносам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоДоначислениеПоАктуПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручениеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыОснованияЕСВ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Это может быть как головная организация, так и обособленное подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Comment>Месяц, которым сумма попадет в отчетность</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПределыСтраховыхВзносов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПределыСтраховыхВзносов</Name>
			<Comment>(регл.)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПределДия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидЕСВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЕСВ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СпециальныеРежимыЗарплатаКадры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СпециальныеРежимыЗарплатаКадры</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезидентДияСити</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеКадровыеДанныеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеКадровыеДанныеСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущееПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеРабочееМестоВОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОформленПоТрудовомуДоговору</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяТерритория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТекущаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТекущаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлассыУсловийТрудаПоДолжностям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КлассыУсловийТрудаПоДолжностям</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УтверждениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеШтатногоРасписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УсловияТруда</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЕСВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыЕСВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяЗарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамГПХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГигКонтрактам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больничные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декретные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленияМобилизованным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитывается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровССотрудниками</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГигКонтракт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактГосслужащего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМуниципальногоСлужащего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактВоеннослужащего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоеннослужащийПоПризыву</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыОплатыПоДоговоруГПХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СпособыОплатыПоДоговоруГПХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОднократноВКонцеСрока</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоАктамВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВКонцеСрокаСАвансовымиПлатежами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыДоговоровАвторскогоЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ВидыДоговоровАвторскогоЗаказа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЕСВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЕСВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УчетСтраховыхВзносовРасширенный/Ext/Module.bsl
//УКРАИНА

Процедура СформироватьДвиженияКатегорииЕСВ(РегистраторОбъект, Движения, СтруктураДанных) Экспорт
	
	Если СтруктураДанных.ДанныеОЕСВСотрудников = Неопределено
		ИЛИ СтруктураДанных.ДанныеОЕСВСотрудников.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Движения.ЕСВСотрудников.Записывать = Истина;
	
	СтруктураДанных.ДанныеОЕСВСотрудников.Колонки.ДатаСобытия.Имя = "Период";
	Движения.ЕСВСотрудников.Загрузить(СтруктураДанных.ДанныеОЕСВСотрудников);
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(РегистраторОбъект)) Тогда
		Если РегистраторОбъект.ДополнительныеСвойства.Свойство("ОтключитьПроверкуДатыЗапретаИзменения")
			И РегистраторОбъект.ДополнительныеСвойства.ОтключитьПроверкуДатыЗапретаИзменения Тогда
			
			Движения.ЕСВСотрудников.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрекратитьВсеПлановыеВзносыПоТаблицеСотрудников(Движения, СотрудникиПериоды) Экспорт
	
	Регистратор = Движения.ЕСВСотрудников.Отбор.Регистратор.Значение;
	
	// Плановые взносы ЕСВ
	Взносы = ДействующиеВзносы(СотрудникиПериоды, Регистратор);
	Для Каждого СтрокаТаблицы Из Взносы Цикл
		СтрокаДвижений = Движения.ЕСВСотрудников.Добавить();
		СтрокаДвижений.Период = 			КонецДня(СтрокаТаблицы.Период) + 1;
		СтрокаДвижений.Сотрудник = 			СтрокаТаблицы.Сотрудник;
		СтрокаДвижений.ФизическоеЛицо = 	СтрокаТаблицы.ФизическоеЛицо;
		СтрокаДвижений.КатегорияЕСВ = 		СтрокаТаблицы.КатегорияЕСВ;
		
		Движения.ЕСВСотрудников.Записывать = Истина;
	КонецЦикла;

КонецПроцедуры

Функция ДействующиеВзносы(ИсходныеДанные, Регистратор)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Регистратор", "<>", Регистратор);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ЕСВСотрудников",
		МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИсходныеДанные),
		ПараметрыПостроения);
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕСВСотрудников.Период,
	|	ЕСВСотрудников.ФизическоеЛицо,
	|	ЕСВСотрудников.Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.КатегорииЗастрахованныхЛицЕСВ.ПустаяСсылка) КАК КатегорияЕСВ
	|ИЗ
	|	ВТЕСВСотрудниковСрезПоследних КАК ЕСВСотрудников
	|ГДЕ
	|	ЕСВСотрудников.КатегорияЕСВ <> ЗНАЧЕНИЕ(Справочник.КатегорииЗастрахованныхЛицЕСВ.ПустаяСсылка)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ВидыЕСВВходитВБазуФСС() Экспорт
	
	Список = Новый Массив();
	Список.Добавить(Перечисления.ВидыЕСВ.ОсновнаяЗарплата);
	Список.Добавить(Перечисления.ВидыЕСВ.НачисленияМобилизованным);
	Список.Добавить(Перечисления.ВидыЕСВ.ПоГигКонтрактам);
	
	Возврат Список;
	
КонецФункции	

Функция ВидЕСВВходитВБазуФСС(ВидЕСВ) Экспорт
	
	Список = ВидыЕСВВходитВБазуФСС();
	
	Возврат Список.Найти(ВидЕСВ) <> Неопределено; 
	
КонецФункции

Процедура ЗаполнитьДанныеСтрокиИсправленияВзносов(ДанныеСтроки, ЭтоВзносыФОТ) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Организация", ДанныеСтроки.Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ДанныеСтроки.ФизическоеЛицо);
	Запрос.УстановитьПараметр("Период", КонецМесяца(ДанныеСтроки.МесяцРасчетногоПериода));
	Запрос.УстановитьПараметр("ВидЕСВ", ДанныеСтроки.ВидЕСВ);
	
	Если ДанныеСтроки.КатегорияЕСВ = Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|   ЕСВСотрудников.КатегорияЕСВ
		|ИЗ
		|	РегистрСведений.ЕСВСотрудников.СрезПоследних(&Период, ФизическоеЛицо = &ФизическоеЛицо) КАК ЕСВСотрудников
		|ГДЕ
		|	ЕСВСотрудников.Сотрудник.ГоловнаяОрганизация = &Организация";
		
		Выборка = Запрос.Выполнить().Выбрать();
		ОсновнаяКатегория = Справочники.КатегорииЗастрахованныхЛицЕСВ.ПустаяСсылка();
		Если Выборка.Следующий() Тогда
			ОсновнаяКатегория = Выборка.КатегорияЕСВ;	
		КонецЕсли;
		Если ДанныеСтроки.ВидЕСВ = Перечисления.ВидыЕСВ.ОсновнаяЗарплата Тогда
			ДанныеСтроки.КатегорияЕСВ = ОсновнаяКатегория;
		ИначеЕсли ДанныеСтроки.ВидЕСВ = Перечисления.ВидыЕСВ.ПоДоговорамГПХ Тогда
			ДанныеСтроки.КатегорияЕСВ = Справочники.КатегорииЗастрахованныхЛицЕСВ.РаботникПоДоговоруГПХ;	
		ИначеЕсли ДанныеСтроки.ВидЕСВ = Перечисления.ВидыЕСВ.НачисленияМобилизованным Тогда
			ДанныеСтроки.КатегорияЕСВ = Справочники.КатегорииЗастрахованныхЛицЕСВ.МобилизованныйРаботник;
		Иначе
			Запрос.УстановитьПараметр("ОсновнаяКатегория", ОсновнаяКатегория);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|   ПараметрыКатегорийЕСВ.СвязаннаяКатегория
			|ИЗ
			|	РегистрСведений.ПараметрыКатегорийЕСВ.СрезПоследних(&Период, Категория = &ОсновнаяКатегория И Вид = &ВидЕСВ) КАК ПараметрыКатегорийЕСВ
			|";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ДанныеСтроки.КатегорияЕСВ = Выборка.СвязаннаяКатегория;
			КонецЕсли;	
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.КатегорияЕСВ) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КатегорияЕСВ", ДанныеСтроки.КатегорияЕСВ);

	Если ДанныеСтроки.Налог = Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|   ПараметрыКатегорийЕСВ.Категория,
		|   ПараметрыКатегорийЕСВ.Вид,
		|   ПараметрыКатегорийЕСВ.ЕСВ,
		|   ПараметрыКатегорийЕСВ.ЕСВФОТ
		|ИЗ
		|	РегистрСведений.ПараметрыКатегорийЕСВ.СрезПоследних(&Период, Категория = &КатегорияЕСВ И Вид = &ВидЕСВ) КАК ПараметрыКатегорийЕСВ
		|";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДанныеСтроки.Налог = ?(ЭтоВзносыФОТ, Выборка.ЕСВФОТ, Выборка.ЕСВ);
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Налог) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Налог", ДанныеСтроки.Налог);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   ШкалаСтавокНалогов.СтатьяНалоговойДекларации
	|ИЗ
	|	РегистрСведений.ШкалаСтавокНалогов.СрезПоследних(&Период, Налог = &Налог И (Организация = &Организация ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) ) КАК ШкалаСтавокНалогов
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеСтроки.СтатьяНалоговойДекларации = Выборка.СтатьяНалоговойДекларации;
	КонецЕсли;
	
	
	
КонецПроцедуры	

Процедура СформироватьПеречислениеВзносовПоТаблицеЗначений(Движения, Отказ, Организация, ДатаОперации, Взносы, ПеречислениеВзносовВыполнено = Истина, Записывать = Ложь) Экспорт
	
	Если НЕ ПеречислениеВзносовВыполнено ИЛИ Взносы = Неопределено Или Взносы.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	ЕстьНовыеСтроки = Ложь;
	Для Каждого СтрокаДанных Из Взносы Цикл
		
		Если СтрокаДанных.Сумма = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		ЕстьНовыеСтроки = Истина;
		НоваяСтрокаРасчетовНалогоплательщика = СтрокаПеречислениеВзносов(Движения, Организация, ДатаОперации, СтрокаДанных);
		
	КонецЦикла;
	
	Если ЕстьНовыеСтроки Тогда
		Если Записывать Тогда
			Движения.РасчетыСФондамиПоСтраховымВзносам.Записать();
			Движения.РасчетыСФондамиПоСтраховымВзносам.Записывать = Ложь;
		Иначе
			Движения.РасчетыСФондамиПоСтраховымВзносам.Записывать = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СтрокаПеречислениеВзносов(Движения, Организация, ДатаОперации, СтрокаВзносов)

	Если Не ЗначениеЗаполнено(СтрокаВзносов.Сумма) Тогда
		Возврат Неопределено
	КонецЕсли;
	
	НоваяСтрока = Движения.РасчетыСФондамиПоСтраховымВзносам.Добавить();
	НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
	НоваяСтрока.Период = ДатаОперации;
	НоваяСтрока.Организация = Организация;
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВзносов);
	
    Возврат НоваяСтрока
	
КонецФункции

Функция ПределСтраховыхВзносовОрганизации(Организация, ДатаОперации) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫБОР
				   |		КОГДА ЕСТЬNULL(СпециальныеРежимыЗарплатаКадрыСрезПоследних.РезидентДияСити, ЛОЖЬ)
				   |			ТОГДА ПределыСтраховыхВзносовСрезПоследних.ПределДия
				   |			ИНАЧЕ ПределыСтраховыхВзносовСрезПоследних.Предел 
				   |	КОНЕЦ КАК Предел
	               |ИЗ
	               |	РегистрСведений.ПределыСтраховыхВзносов.СрезПоследних(&ДатаОперации, ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата)) КАК ПределыСтраховыхВзносовСрезПоследних
				   |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпециальныеРежимыЗарплатаКадры.СрезПоследних(&ДатаОперации, Организация = &Организация) КАК СпециальныеРежимыЗарплатаКадрыСрезПоследних
				   |	ПО ИСТИНА";
	Запрос.УстановитьПараметр("ДатаОперации", ДатаОперации);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Предел;
	Иначе	                   
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	

// Обслуживание печати в документах выплаты зарплаты.

Процедура ДобавитьКомандуПечатиРеестраПеречисленногоНалога(КомандыПечати) Экспорт
	
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеНалоговИВзносов, ЧтениеНалоговИВзносов", , Ложь) Тогда
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "ПФ_MXL_РеестрПеречисленныхСуммВзносов";
		КомандаПечати.Представление = НСтр("ru='Реестр перечисленных сумм взносов';uk='Реєстр перерахованих сум внесків'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
	КонецЕсли
	
КонецПроцедуры

Процедура ВывестиРеестрПеречисленногоНалогаПоПлатежномуДокументу(КоллекцияПечатныхФорм, МассивОбъектов, ОбъектыПечати, КодЯзыка) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеестрПеречисленныхСуммВзносов";
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_РеестрПеречисленныхСуммВзносов",КодЯзыка);
	
	НастройкиПечатныхФорм = ЗарплатаКадрыПовтИсп.НастройкиПечатныхФорм();
	
	// получаем данные для печати
	ВыборкаШапок = ВедомостИВыборкаДляПечатиШапки(МассивОбъектов);
	ВыборкаСтрок = ВедомостиВыборкаДляПечатиТаблицы(МассивОбъектов);

	ПервыйДокумент = Истина;
	Пока ВыборкаШапок.Следующий() Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подсчитываем количество страниц документа - для корректного разбиения на страницы.
		ВсегоСтрокДокумента = ВыборкаСтрок.Количество();
		
		ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
		
		// выводим данные о документе
		ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаШапок);
		ОбластьМакетаШапка.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапка.Параметры.НазваниеОрганизации);
		ОбластьМакетаШапка.Параметры.Номер			= КадровыйУчетРасширенный.НомерКадровогоПриказа(ВыборкаШапок.Номер);
		ОбластьМакетаШапка.Параметры.Дата			= Формат(ВыборкаШапок.Дата, "ДФ=dd.MM.yyyy");
		ОбластьМакетаШапка.Параметры.ПериодРегистрации	= Формат(ВыборкаШапок.ПериодРегистрации, "Л="+КодЯзыка+";" "ДФ = 'ММММ гггг'");
		
		
		ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаШапок); // Подвал документа.
		
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0; Итого = 0;
		
		// Выводим данные по строкам документа.
		НомерСтроки = 0;
		ВыборкаСтрок.Сбросить();
		Пока ВыборкаСтрок.НайтиСледующий(ВыборкаШапок.Ссылка, "Ведомость") Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрок);
			ОбластьМакетаСтрока.Параметры.НомерСтроки = НомерСтроки;
				
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
			ИтогоНаСтранице = ИтогоНаСтранице + ВыборкаСтрок.Сумма;
			Итого = Итого + ВыборкаСтрок.Сумма;
			
		КонецЦикла; // по строкам документа
		
		ОбластьМакетаПодвал.Параметры.СуммаУплатыВсего = Итого;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапок.Ссылка);
		
	КонецЦикла; // по документам
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_РеестрПеречисленныхСуммВзносов", 
		НСтр("ru='Реестр перечисленных сумм взносов';uk='Реєстр перерахованих сум внесків'"), ТабличныйДокумент, , "ОбщийМакет.ПФ_MXL_РеестрПеречисленныхСуммВзносов",,Истина);
	
КонецПроцедуры

Функция НужноПечататьРеестрПеречисленногоНалога(КоллекцияПечатныхФорм) Экспорт
	
	Возврат УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_РеестрПеречисленныхСуммВзносов");
	
КонецФункции

Функция ВедомостИВыборкаДляПечатиШапки(МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка.Дата КАК Дата,
	|	ВедомостьНаВыплатуЗарплатыВБанк.Номер КАК Номер,
	|	ВедомостьНаВыплатуЗарплатыВБанк.ПериодРегистрации КАК ПериодРегистрации,
	|	ВедомостьНаВыплатуЗарплатыВБанк.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ВедомостьНаВыплатуЗарплатыВБанк.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
	|	ВедомостьНаВыплатуЗарплатыВБанк.Организация.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
	|	ВедомостьНаВыплатуЗарплатыВБанк.ГлавныйБухгалтер,
	|	ВедомостьНаВыплатуЗарплатыВБанк.Бухгалтер
	|ПОМЕСТИТЬ ВТДанныеРегистраторов
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК ВедомостьНаВыплатуЗарплатыВБанк
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВКассу.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Ссылка.Дата КАК Дата,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Номер КАК Номер,
	|	ВедомостьНаВыплатуЗарплатыВКассу.ПериодРегистрации КАК ПериодРегистрации,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ВедомостьНаВыплатуЗарплатыВКассу.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Организация.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
	|	ВедомостьНаВыплатуЗарплатыВКассу.ГлавныйБухгалтер,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Бухгалтер
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу КАК ВедомостьНаВыплатуЗарплатыВКассу
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВКассу.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Ссылка.Дата КАК Дата,
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Номер КАК Номер,
	|	ВедомостьНаВыплатуЗарплатыПеречислением.ПериодРегистрации КАК ПериодРегистрации,
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ВедомостьНаВыплатуЗарплатыПеречислением.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Организация.КодПоЕДРПОУ КАК КодПоЕДРПОУ,	
	|	ВедомостьНаВыплатуЗарплатыПеречислением.ГлавныйБухгалтер,
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Бухгалтер
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыПеречислением КАК ВедомостьНаВыплатуЗарплатыПеречислением
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Ссылка.Дата КАК Дата,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Номер КАК Номер,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.ПериодРегистрации КАК ПериодРегистрации,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ВедомостьНаВыплатуЗарплатыРаздатчиком.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Организация.КодПоЕДРПОУ КАК КодПоЕДРПОУ,	
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.ГлавныйБухгалтер,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Бухгалтер
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком КАК ВедомостьНаВыплатуЗарплатыРаздатчиком
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Ссылка В(&МассивОбъектов)
	|";

	Запрос.Выполнить();
	
	ИменаПолейОтветственныхЛиц = Новый Массив;
	ИменаПолейОтветственныхЛиц.Добавить("ГлавныйБухгалтер");
	ИменаПолейОтветственныхЛиц.Добавить("Бухгалтер");
	
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Ложь, ИменаПолейОтветственныхЛиц, "ВТДанныеРегистраторов");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Организация,
	|	ДанныеДокументов.Дата,
	|	ДанныеДокументов.Номер,
	|	ДанныеДокументов.ПериодРегистрации,
	|	ДанныеДокументов.НазваниеОрганизации,
	|	ДанныеДокументов.КодПоЕДРПОУ,
	|	ЕСТЬNULL(ФИОГлавногоБухгалтера.РасшифровкаПодписи, """") КАК ГлавныйБухгалтер,
	|	ЕСТЬNULL(ФИОБухгалтера.РасшифровкаПодписи, """") КАК Бухгалтер
	|ИЗ
	|	ВТДанныеРегистраторов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОГлавногоБухгалтера
	|		ПО ДанныеДокументов.Ссылка = ФИОГлавногоБухгалтера.Ссылка
	|			И ДанныеДокументов.ГлавныйБухгалтер = ФИОГлавногоБухгалтера.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОБухгалтера
	|		ПО ДанныеДокументов.Ссылка = ФИОБухгалтера.Ссылка
	|			И ДанныеДокументов.Бухгалтер = ФИОБухгалтера.ФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокументов.Ссылка";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ВедомостиВыборкаДляПечатиТаблицы(МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка.Дата КАК Дата,
	|	ВедомостьНаВыплатуЗарплатыВБанк.Налог КАК Налог,
	|	СУММА(ВедомостьНаВыплатуЗарплатыВБанк.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТНДФЛ
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк.ВзносыФОТ КАК ВедомостьНаВыплатуЗарплатыВБанк
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка В(&МассивОбъектов)
	|   И ВедомостьНаВыплатуЗарплатыВБанк.Сумма<>0
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка.Дата,
	|	ВедомостьНаВыплатуЗарплатыВБанк.Налог
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВКассу.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Ссылка.Дата КАК Дата,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Налог КАК Налог,
	|	СУММА(ВедомостьНаВыплатуЗарплатыВКассу.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу.ВзносыФОТ КАК ВедомостьНаВыплатуЗарплатыВКассу
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВКассу.Ссылка В(&МассивОбъектов)
	|   И ВедомостьНаВыплатуЗарплатыВКассу.Сумма<>0
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьНаВыплатуЗарплатыВКассу.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Налог
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Ссылка.Дата КАК Дата,
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Налог КАК Налог,
	|	СУММА(ВедомостьНаВыплатуЗарплатыПеречислением.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыПеречислением.ВзносыФОТ КАК ВедомостьНаВыплатуЗарплатыПеречислением
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Ссылка В(&МассивОбъектов)
	|   И ВедомостьНаВыплатуЗарплатыПеречислением.Сумма<>0
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Ссылка.Дата,
	|	ВедомостьНаВыплатуЗарплатыПеречислением.Налог
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Ссылка.Дата КАК Дата,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Налог КАК Налог,
	|	СУММА(ВедомостьНаВыплатуЗарплатыРаздатчиком.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.ВзносыФОТ КАК ВедомостьНаВыплатуЗарплатыРаздатчиком
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Ссылка В(&МассивОбъектов)
	|   И ВедомостьНаВыплатуЗарплатыРаздатчиком.Сумма<>0
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Ссылка,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Ссылка.Дата,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Налог
	|";

	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НДФЛ.Ссылка КАК Ведомость,
	|	НДФЛ.Налог,
	|	НДФЛ.Сумма КАК Сумма
	|ИЗ
	|	ВТНДФЛ КАК НДФЛ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НДФЛ.Ссылка,
	|	НДФЛ.Налог";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции	





#Область СлужебныйПрограммныйИнтерфейс


// Помещает в переданный МенеджерВременныхТаблиц таблицу 
//	ВТКадровыхДанных, которая содержит следующие поля.
//		Сотрудник - СправочникСсылка.Сотрудники
//		ДатаНачала - дата
//		Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//		Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//		Должность - СправочникСсылка.Должности
//		КоэффициентУчетаСтроки - число от 0 до 1.
//		УсловияТруда - СправочникСсылка.УсловияТруда
//      	 
// Параметры:
//		Организация -
//		ПериодРегистрации - дата -
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит вр. таблицу ВТНачисления с полями.
//				Сотрудник - СправочникСсылка.Сотрудники
//				ДатаНачала - дата -
//				Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления -
//				ПодразделениеОрганизации - СправочникСсылка.ПодразделенияОрганизаций
//				УсловияТруда - СправочникСсылка.УсловияТруда
//
Процедура СформироватьВТКадровыхДанных(Организация, ПериодРегистрации, МенеджерВременныхТаблиц) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией", Новый Структура("Организация",Организация)) Тогда
		
		УчетСтраховыхВзносовБазовый.СформироватьВТКадровыхДанных(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, Ложь);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КадровыхДанных.Сотрудник,
		|	КадровыхДанных.ДатаНачала,
		|	КадровыхДанных.Начисление,
		|	КадровыхДанных.Подразделение,
		|	КадровыхДанных.Должность,
		|	КадровыхДанных.КоэффициентУчетаСтроки
		|ПОМЕСТИТЬ ВТВременнаяТаблица
		|ИЗ
		|	ВТКадровыхДанных КАК КадровыхДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисления КАК СписокНачислений
		|		ПО КадровыхДанных.Сотрудник = СписокНачислений.Сотрудник
		|			И КадровыхДанных.ДатаНачала = СписокНачислений.ДатаНачала
		|			И КадровыхДанных.Подразделение = СписокНачислений.ПодразделениеОрганизации
		|			И КадровыхДанных.Начисление = СписокНачислений.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТКадровыхДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Сотрудник,
		|	ВременнаяТаблица.ДатаНачала,
		|	ВременнаяТаблица.Начисление,
		|	ВременнаяТаблица.Подразделение,
		|	ВременнаяТаблица.Должность,
		|	ВременнаяТаблица.КоэффициентУчетаСтроки
		|ПОМЕСТИТЬ ВТКадровыхДанных
		|ИЗ
		|	ВТВременнаяТаблица КАК ВременнаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВременнаяТаблица";
		Запрос.Выполнить();
		
		Возврат
		
	КонецЕсли;
	
	НачалоПериода = НачалоМесяца(ПериодРегистрации);
	ОкончаниеПериода = КонецМесяца(ПериодРегистрации);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("ИспользоватьШтатноеРасписание", ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание"));
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(МенеджерВременныхТаблиц, НачалоПериода, ОкончаниеПериода, "ДЕНЬ");
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНачислений.Сотрудник,
	|	Периоды.Период,
	|	Периоды.Период КАК ДатаНачала,
	|	Периоды.Период КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТПоДнямМесяца
	|ИЗ
	|	ВТНачисления КАК СписокНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериоды КАК Периоды
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Интервалы.Сотрудник,
	|	НАЧАЛОПЕРИОДА(Интервалы.Период, ДЕНЬ) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(Интервалы.Период, ДЕНЬ) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСотрудникиИнтервалы
	|ИЗ
	|	ВТПоДнямМесяца КАК Интервалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериоды";
	Запрос.Выполнить();
	
	// Получаем данные о времени за интервалы.
	УчетРабочегоВремени.СоздатьВТРабочееСотрудниковВремяПоИнтервалам(МенеджерВременныхТаблиц, ПериодРегистрации);

	// Получаем данные о состояниях.
	СостоянияСотрудников.СоздатьВТПериодыСостоянийСотрудников(МенеджерВременныхТаблиц, "ВТПоДнямМесяца");

	КадровыеДанные = "ДатаПриема, ДатаУвольнения, Должность, ДолжностьПоШтатномуРасписанию";
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		МенеджерВременныхТаблиц,
		"ВТПоДнямМесяца");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Ложь, КадровыеДанные);
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.ДатаНачала,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.ПодразделениеОрганизации КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Начисления.Ссылка ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		КОГДА (Начисления.ТребуетсяРасчетБазы
	|				ИЛИ Начисления.НачисляетсяВЦеломЗаМесяц)
	|				И НЕ Начисления.ЗачетНормыВремени
	|			ТОГДА ИСТИНА
	|		КОГДА СписокНачислений.ДатаНачала МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РаспределятьСтроку
	|ПОМЕСТИТЬ ВТРаспределяемыеСтроки
	|ИЗ
	|	ВТНачисления КАК СписокНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
	|		ПО СписокНачислений.Начисление = Начисления.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиПоДнямМесяца.Сотрудник,
	|	СотрудникиПоДнямМесяца.Период
	|ПОМЕСТИТЬ ВТВОтпускеПоУходу
	|ИЗ
	|	ВТПоДнямМесяца КАК СотрудникиПоДнямМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыСостоянийСотрудников КАК ДанныеОСотруднике
	|		ПО СотрудникиПоДнямМесяца.Сотрудник = ДанныеОСотруднике.Сотрудник
	|			И (СотрудникиПоДнямМесяца.Период МЕЖДУ ДанныеОСотруднике.Начало И ДанныеОСотруднике.Окончание)
	|ГДЕ
	|	ДанныеОСотруднике.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком) 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериодыСостоянийСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСотрудникиИнтервалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиПоДнямМесяца.Сотрудник,
	|	СотрудникиПоДнямМесяца.Период,
	|	ДанныеОСотруднике.Должность,
	|	ДанныеОСотруднике.ДолжностьПоШтатномуРасписанию,
	|	ВЫБОР
	|		КОГДА СотрудникиПоДнямМесяца.Период < ДанныеОСотруднике.ДатаПриема
	|			ТОГДА ИСТИНА
	|		КОГДА ДанныеОСотруднике.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И СотрудникиПоДнямМесяца.Период > ДанныеОСотруднике.ДатаУвольнения
	|			ТОГДА ИСТИНА
	|		КОГДА ВОтпускеПоУходу.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеРаботает,
	|	ВЫБОР
	|		КОГДА СотрудникиПоДнямМесяца.Период < ДанныеОСотруднике.ДатаПриема
	|			ТОГДА 0
	|		КОГДА ДанныеОСотруднике.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И СотрудникиПоДнямМесяца.Период > ДанныеОСотруднике.ДатаУвольнения
	|			ТОГДА 0
	|		КОГДА ВОтпускеПоУходу.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РабочееВремяПоИнтервалам.НормаДней, 0)
	|	КОНЕЦ КАК Дней,
	|	ВЫБОР
	|		КОГДА СотрудникиПоДнямМесяца.Период < ДанныеОСотруднике.ДатаПриема
	|			ТОГДА 0
	|		КОГДА ДанныеОСотруднике.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И СотрудникиПоДнямМесяца.Период > ДанныеОСотруднике.ДатаУвольнения
	|			ТОГДА 0
	|		КОГДА ВОтпускеПоУходу.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РабочееВремяПоИнтервалам.НормаЧасов, 0)
	|	КОНЕЦ КАК Часов
	|ПОМЕСТИТЬ ВТВремяПоДням
	|ИЗ
	|	ВТПоДнямМесяца КАК СотрудникиПоДнямМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВОтпускеПоУходу КАК ВОтпускеПоУходу
	|		ПО СотрудникиПоДнямМесяца.Сотрудник = ВОтпускеПоУходу.Сотрудник
	|			И СотрудникиПоДнямМесяца.Период = ВОтпускеПоУходу.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ДанныеОСотруднике
	|		ПО СотрудникиПоДнямМесяца.Сотрудник = ДанныеОСотруднике.Сотрудник
	|			И СотрудникиПоДнямМесяца.Период = ДанныеОСотруднике.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочееВремяПоИнтервалам КАК РабочееВремяПоИнтервалам
	|		ПО СотрудникиПоДнямМесяца.Сотрудник = РабочееВремяПоИнтервалам.Сотрудник
	|			И СотрудникиПоДнямМесяца.Период = РабочееВремяПоИнтервалам.ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПоДнямМесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВОтпускеПоУходу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадровыеДанныеСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТРабочееВремяПоИнтервалам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремяПоДням.Сотрудник,
	|	СУММА(ВремяПоДням.Дней) КАК Дней,
	|	СУММА(ВремяПоДням.Часов) КАК Часов
	|ПОМЕСТИТЬ ВТВремяЗаМесяц
	|ИЗ
	|	ВТВремяПоДням КАК ВремяПоДням
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремяПоДням.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремяПоДням.Сотрудник КАК Сотрудник,
	|	ВремяПоДням.Должность,
	|	ВремяПоДням.ДолжностьПоШтатномуРасписанию,
	|	ВЫБОР
	|		КОГДА ВремяЗаМесяц.Часов = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВремяПоДням.Часов) / ВремяЗаМесяц.Часов КАК ЧИСЛО(8, 6))
	|	КОНЕЦ КАК КоэффициентЧасов
	|ПОМЕСТИТЬ ВТКоэффициентыПоЧасам
	|ИЗ
	|	ВТВремяПоДням КАК ВремяПоДням
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВремяЗаМесяц КАК ВремяЗаМесяц
	|		ПО ВремяПоДням.Сотрудник = ВремяЗаМесяц.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремяЗаМесяц.Часов,
	|	ВремяПоДням.Сотрудник,
	|	ВремяПоДням.Должность,
	|	ВремяПоДням.ДолжностьПоШтатномуРасписанию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВремяЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДолжностьСМаксимальнымКоэффициентом.Сотрудник,
	|	ДолжностьСМаксимальнымКоэффициентом.КоэффициентЧасов,
	|	ДолжностьСМаксимальнымКоэффициентом.Должность,
	|	МАКСИМУМ(КоэффициентыПоЧасам.ДолжностьПоШтатномуРасписанию) КАК ДолжностьПоШтатномуРасписанию
	|ПОМЕСТИТЬ ВТПараметрыМаксимальногоКоэффициента
	|ИЗ
	|	(ВЫБРАТЬ
	|		МаксимальныйКоэффициент.Сотрудник КАК Сотрудник,
	|		МаксимальныйКоэффициент.КоэффициентЧасов КАК КоэффициентЧасов,
	|		МАКСИМУМ(КоэффициентыПоЧасам.Должность) КАК Должность
	|	ИЗ
	|		(ВЫБРАТЬ
	|			КоэффициентыПоЧасам.Сотрудник КАК Сотрудник,
	|			МАКСИМУМ(КоэффициентыПоЧасам.КоэффициентЧасов) КАК КоэффициентЧасов
	|		ИЗ
	|			ВТКоэффициентыПоЧасам КАК КоэффициентыПоЧасам
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КоэффициентыПоЧасам.Сотрудник) КАК МаксимальныйКоэффициент
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыПоЧасам КАК КоэффициентыПоЧасам
	|			ПО МаксимальныйКоэффициент.Сотрудник = КоэффициентыПоЧасам.Сотрудник
	|				И МаксимальныйКоэффициент.КоэффициентЧасов = КоэффициентыПоЧасам.КоэффициентЧасов
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МаксимальныйКоэффициент.Сотрудник,
	|		МаксимальныйКоэффициент.КоэффициентЧасов) КАК ДолжностьСМаксимальнымКоэффициентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыПоЧасам КАК КоэффициентыПоЧасам
	|		ПО ДолжностьСМаксимальнымКоэффициентом.Сотрудник = КоэффициентыПоЧасам.Сотрудник
	|			И ДолжностьСМаксимальнымКоэффициентом.КоэффициентЧасов = КоэффициентыПоЧасам.КоэффициентЧасов
	|			И ДолжностьСМаксимальнымКоэффициентом.Должность = КоэффициентыПоЧасам.Должность
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолжностьСМаксимальнымКоэффициентом.Сотрудник,
	|	ДолжностьСМаксимальнымКоэффициентом.КоэффициентЧасов,
	|	ДолжностьСМаксимальнымКоэффициентом.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоэффициентыПоЧасам.Сотрудник,
	|	КоэффициентыПоЧасам.Должность,
	|	КоэффициентыПоЧасам.ДолжностьПоШтатномуРасписанию,
	|	КоэффициентыПоЧасам.КоэффициентЧасов
	|ПОМЕСТИТЬ ВТПрочиеКоэффициенты
	|ИЗ
	|	ВТКоэффициентыПоЧасам КАК КоэффициентыПоЧасам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПараметрыМаксимальногоКоэффициента КАК ПараметрыМаксимальногоКоэффициента
	|		ПО КоэффициентыПоЧасам.Сотрудник = ПараметрыМаксимальногоКоэффициента.Сотрудник
	|			И КоэффициентыПоЧасам.Должность = ПараметрыМаксимальногоКоэффициента.Должность
	|			И КоэффициентыПоЧасам.ДолжностьПоШтатномуРасписанию = ПараметрыМаксимальногоКоэффициента.ДолжностьПоШтатномуРасписанию
	|ГДЕ
	|	ПараметрыМаксимальногоКоэффициента.Сотрудник ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКоэффициентыПоЧасам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеКоэффициенты.Сотрудник,
	|	ПрочиеКоэффициенты.Должность,
	|	ПрочиеКоэффициенты.ДолжностьПоШтатномуРасписанию,
	|	ПрочиеКоэффициенты.КоэффициентЧасов
	|ПОМЕСТИТЬ ВТКоэффициентыПоДолжностям
	|ИЗ
	|	ВТПрочиеКоэффициенты КАК ПрочиеКоэффициенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПараметрыМаксимальногоКоэффициента.Сотрудник,
	|	ПараметрыМаксимальногоКоэффициента.Должность,
	|	ПараметрыМаксимальногоКоэффициента.ДолжностьПоШтатномуРасписанию,
	|	1 - ЕСТЬNULL(СуммаПрочихКоэффициентов.КоэффициентЧасов, 0)
	|ИЗ
	|	ВТПараметрыМаксимальногоКоэффициента КАК ПараметрыМаксимальногоКоэффициента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПрочиеКоэффициенты.Сотрудник КАК Сотрудник,
	|			СУММА(ПрочиеКоэффициенты.КоэффициентЧасов) КАК КоэффициентЧасов
	|		ИЗ
	|			ВТПрочиеКоэффициенты КАК ПрочиеКоэффициенты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПрочиеКоэффициенты.Сотрудник) КАК СуммаПрочихКоэффициентов
	|		ПО ПараметрыМаксимальногоКоэффициента.Сотрудник = СуммаПрочихКоэффициентов.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПараметрыМаксимальногоКоэффициента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПрочиеКоэффициенты";
	Запрос.Выполнить();

	// Читаем кадровые данные сотрудников, влияющие на исчисление взносов.
	
	КадровыеДанные = "Должность, ДолжностьПоШтатномуРасписанию";
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		МенеджерВременныхТаблиц, "ВТНачисления", "Сотрудник,ДатаНачала");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Ложь, КадровыеДанные);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.ДатаНачала,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА СписокНачислений.УсловияТруда = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка)
	|		ИНАЧЕ СписокНачислений.УсловияТруда
	|	КОНЕЦ КАК УсловияТруда
	|ПОМЕСТИТЬ ВТУточненныеНачисления
	|ИЗ
	|	ВТНачисления КАК СписокНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.ДатаНачала,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.ПодразделениеОрганизации КАК Подразделение,
	|	СписокНачислений.УсловияТруда,
	|	ВЫБОР
	|		КОГДА ДанныеПоДням.НеРаботает
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|		КОГДА РаспределяемыеСтроки.РаспределятьСтроку
	|				И КоэффициентыПоДолжностям.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьШтатноеРасписание
	|						ТОГДА КоэффициентыПоДолжностям.ДолжностьПоШтатномуРасписанию
	|					ИНАЧЕ КоэффициентыПоДолжностям.Должность
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ИспользоватьШтатноеРасписание
	|					ТОГДА ДанныеОСотруднике.ДолжностьПоШтатномуРасписанию
	|				ИНАЧЕ ДанныеОСотруднике.Должность
	|			КОНЕЦ
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА СписокНачислений.УсловияТруда.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией ЕСТЬ НЕ NULL 
	|			ТОГДА 1
	|		КОГДА ДанныеПоДням.НеРаботает
	|			ТОГДА 1
	|		КОГДА РаспределяемыеСтроки.РаспределятьСтроку
	|				И КоэффициентыПоДолжностям.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыПоДолжностям.КоэффициентЧасов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентУчетаСтроки
	|ПОМЕСТИТЬ ВТКадровыхДанных
	|ИЗ
	|	ВТУточненныеНачисления КАК СписокНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределяемыеСтроки КАК РаспределяемыеСтроки
	|		ПО СписокНачислений.Сотрудник = РаспределяемыеСтроки.Сотрудник
	|			И СписокНачислений.ДатаНачала = РаспределяемыеСтроки.ДатаНачала
	|			И СписокНачислений.ПодразделениеОрганизации = РаспределяемыеСтроки.Подразделение
	|			И СписокНачислений.Начисление = РаспределяемыеСтроки.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ДанныеОСотруднике
	|		ПО СписокНачислений.Сотрудник = ДанныеОСотруднике.Сотрудник
	|			И СписокНачислений.ДатаНачала = ДанныеОСотруднике.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВремяПоДням КАК ДанныеПоДням
	|		ПО СписокНачислений.Сотрудник = ДанныеПоДням.Сотрудник
	|			И СписокНачислений.ДатаНачала = ДанныеПоДням.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыПоДолжностям КАК КоэффициентыПоДолжностям
	|		ПО СписокНачислений.Сотрудник = КоэффициентыПоДолжностям.Сотрудник
	|			И (РаспределяемыеСтроки.РаспределятьСтроку)
	|			И (НЕ ДанныеПоДням.НеРаботает)
	|			И (КоэффициентыПоДолжностям.КоэффициентЧасов <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТРаспределяемыеСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТУточненныеНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВремяПоДням
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКоэффициентыПоДолжностям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадровыеДанныеСотрудников";
	Запрос.Выполнить();
	
КонецПроцедуры

// Помещает в переданный МенеджерВременныхТаблиц таблицу 
//	ВТСДаннымиУчета, которая содержит следующие поля
//		Сотрудник - СправочникСсылка.Сотрудники
//		ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//		ДатаНачала - дата
//		Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//		ВидЕСВ - ПеречислениеСсылка.ВидыЕСВ
//		Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//		УсловияТруда - СправочникСсылка.УсловияТруда
//      	 
// Параметры:
//		Организация -
//		ПериодРегистрации - дата -
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит
//			вр. таблицу ВТНачисления с полями:
//				Сотрудник - СправочникСсылка.Сотрудники
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				ДатаНачала - дата
//				Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//				ПодразделениеОрганизации - СправочникСсылка.ПодразделенияОрганизаций
//				УсловияТруда - СправочникСсылка.УсловияТруда
//
Процедура СформироватьВТСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц) Экспорт 

	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.ДатаНачала,
	|	НАЧАЛОПЕРИОДА(СписокНачислений.ДатаНачала, МЕСЯЦ) КАК ПериодДействия,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.ПодразделениеОрганизации КАК Подразделение,
	|	СписокНачислений.УсловияТруда,
	|	СписокНачислений.СуммаДохода КАК Сумма,
	|	Сотрудники.ФизическоеЛицо,
    |	Начисления.ВидЕСВ,
	|   ВЫБОР
	|    КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска)) 
	|			И ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ТекущийВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ТрудовойДоговор)) <>  ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ГигКонтракт)
	|     ТОГДА Истина
	|     ИНАЧЕ ЛОЖЬ
	|   КОНЕЦ КАК ЭтоОтпускные
	|ПОМЕСТИТЬ ВТВременнаяТаблица
	|ИЗ
	|	ВТНачисления КАК СписокНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
	|		ПО СписокНачислений.Начисление = Начисления.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО СписокНачислений.Сотрудник = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ПО СписокНачислений.Сотрудник = ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|ГДЕ
	|   НЕ Начисления.ВидЕСВ В (ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.НеУчитывается), ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	СписокНачислений.Сотрудник,
	|	СписокНачислений.ДатаНачала,
	|	СписокНачислений.ПериодДействия,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.Подразделение,
	|	СписокНачислений.УсловияТруда,
	|	СписокНачислений.Сумма,
	|	СписокНачислений.ФизическоеЛицо,
    |	СписокНачислений.ВидЕСВ,
	|   СписокНачислений.ЭтоОтпускные,
	|   ВЫБОР 
	|    КОГДА СписокНачислений.ЭтоОтпускные
	|     ТОГДА ВЫБОР
	|   	     КОГДА СписокНачислений.ПериодДействия >= &ПериодРегистрации
	|   	      ТОГДА СписокНачислений.ПериодДействия
	|   	      ИНАЧЕ &ПериодРегистрации
	|   	    КОНЕЦ
	|    КОГДА СписокНачислений.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.Больничные)
	|     ТОГДА ВЫБОР
	|   	     КОГДА СписокНачислений.ПериодДействия <= &ПериодРегистрации
	|   	      ТОГДА СписокНачислений.ПериодДействия
	|   	      ИНАЧЕ &ПериодРегистрации
	|   	    КОНЕЦ
	|    КОГДА СписокНачислений.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.Декретные)
	|     ТОГДА СписокНачислений.ПериодДействия
	|    ИНАЧЕ &ПериодРегистрации
	|  КОНЕЦ КАК НалоговыйПериод
	|ПОМЕСТИТЬ ВТСДаннымиУчета
	|ИЗ
	|	ВТВременнаяТаблица КАК СписокНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВременнаяТаблица";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует таблицу значений с данными для проведения по регистру СведенияОДоходахСтраховыеВзносы.
// 
// Параметры:
//		Организация
//		ПериодРегистрации
//		МенеджерВременныхТаблиц содержит вр. таблицу ВТНачисленияСтраховыеВзносы с полями.
//				Сотрудник
//				Подразделение
//				ДатаНачала
//				КодДоходаСтраховыеВзносы
//				ЗаключенСоСтудентомРаботающимВСтудотряде.
//				Начисление
//				СуммаДохода
//				СуммаВычетаВзносы
//				ОблагаетсяЕНВД
//
Функция СведенияОДоходахПоДоговорамСтраховыеВзносы(Организация, ПериодРегистрации, МенеджерВременныхТаблиц) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокНачислений.Договор,
	|	СписокНачислений.Сумма КАК Сумма,
	|	НАЧАЛОПЕРИОДА(ДоговорРаботыУслуги.ДатаНачала, МЕСЯЦ) КАК ДатаНачалаДоговора,
	|	НАЧАЛОПЕРИОДА(ДоговорРаботыУслуги.ДатаОкончания, МЕСЯЦ) КАК ДатаОкончанияДоговора
	|ИЗ
	|	ВТНачисленияПоДоговорам КАК СписокНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДоговорРаботыУслуги КАК ДоговорРаботыУслуги
	|		ПО СписокНачислений.Договор = ДоговорРаботыУслуги.Ссылка
	|ГДЕ
	|	ДоговорРаботыУслуги.СпособОплаты = ЗНАЧЕНИЕ(Перечисление.СпособыОплатыПоДоговоруГПХ.ОднократноВКонцеСрока)";
	
	ТаблицаДоговораКРазбиению = Запрос.Выполнить().Выгрузить();
	
	ТаблицаНалоговыеПериоды = Новый ТаблицаЗначений();
	ТаблицаНалоговыеПериоды.Колонки.Добавить("НалоговыйПериод", Новый ОписаниеТипов("Дата"));
	ТаблицаНалоговыеПериоды.Колонки.Добавить("Договор", Новый ОписаниеТипов("ДокументСсылка.ДоговорРаботыУслуги"));
	ТаблицаНалоговыеПериоды.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0)));
	
	Для Каждого Договор Из ТаблицаДоговораКРазбиению Цикл
		НС = ТаблицаНалоговыеПериоды.Добавить();
		НС.НалоговыйПериод = НачалоМесяца(Договор.ДатаНачалаДоговора);
		НС.Договор = Договор.Договор;
		НС.Коэффициент = 1;
		ДатаОкончания = Договор.ДатаНачалаДоговора; 
		Пока ДатаОкончания < Договор.ДатаОкончанияДоговора Цикл
			ДатаОкончания = ДобавитьМесяц(ДатаОкончания, 1);
			НС = ТаблицаНалоговыеПериоды.Добавить();
			НС.НалоговыйПериод = НачалоМесяца(ДатаОкончания);
			НС.Договор = Договор.Договор;
			НС.Коэффициент = 1;
		КонецЦикла;	
	КонецЦикла;
	
	//Распределение таблицы документов по таблице налоговых периодов
	ПоляРазрез = Новый Массив();
	ПоляРазрез.Добавить("НалоговыйПериод");
	ПоляСвязи = Новый Структура();
	ПоляСвязи.Вставить("Договор","Договор");
	ТаблицаДоговораПоПериодам = ЗарплатаКадры.РаспределитьТаблицуПропорциональноТаблицеКоэффициентов(ТаблицаДоговораКРазбиению, "Сумма", ТаблицаНалоговыеПериоды, "Коэффициент", ПоляРазрез, ПоляСвязи);

	Запрос.УстановитьПараметр("ТаблицаДоговораПоПериодам",ТаблицаДоговораПоПериодам);
	Запрос.УстановитьПараметр("ПериодРегистрации",ПериодРегистрации);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДоговораПоПериодам.Договор,
	|	ТаблицаДоговораПоПериодам.НалоговыйПериод,
	|	ТаблицаДоговораПоПериодам.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТТаблицаДоговораПоПериодам
	|ИЗ
	|	&ТаблицаДоговораПоПериодам КАК ТаблицаДоговораПоПериодам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокНачислений.Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СписокНачислений.Начисление,
	|	СписокНачислений.Подразделение,
	|	СписокНачислений.ДатаНачала,
	|	СписокНачислений.Договор КАК ДокументОснование,
	|	ЕСТЬNULL(ТаблицаДоговораПоПериодам.НалоговыйПериод, &ПериодРегистрации) КАК НалоговыйПериод,
	|	ЕСТЬNULL(ВидыДоговоровАвторскогоЗаказа.ВидЕСВ, ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ПоДоговорамГПХ)) КАК ВидЕСВ,
	|	ЛОЖЬ КАК ЭтоОтпускные,
	|	ЕСТЬNULL(ТаблицаДоговораПоПериодам.Сумма, СписокНачислений.Сумма) КАК Сумма
	|ИЗ
	|	ВТНачисленияПоДоговорам КАК СписокНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО СписокНачислений.Сотрудник = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаДоговораПоПериодам КАК ТаблицаДоговораПоПериодам
	|		ПО СписокНачислений.Договор = ТаблицаДоговораПоПериодам.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДоговорАвторскогоЗаказа КАК ДоговорАвторскогоЗаказа
	|		ПО СписокНачислений.Договор = ДоговорАвторскогоЗаказа.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДоговоровАвторскогоЗаказа КАК ВидыДоговоровАвторскогоЗаказа
	|		ПО ВидыДоговоровАвторскогоЗаказа.Ссылка = ДоговорАвторскогоЗаказа.ВидАвторскогоДоговора	
	|";	
	
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Формирует строку описания реквизитов, содержащих суммы взносов.
//      	 
// Параметры:
//		ИмяТабличнойЧасти - строка - необязательный, по умолчанию подразумевается т.ч. "Взносы".
//		ВключатьДопТарифы - булево - необязательный, если выставлен в Ложь, взносы по доп.тарифам в описание не включаются.
//
// Возвращаемое значение:
//		строка
//
Функция ОписаниеПолейВзносовСтрокой(ИмяТабличнойЧасти = "Взносы", ВключатьДопТарифы = Истина) Экспорт 

	Возврат УчетСтраховыхВзносов.РассчитываемыеВзносы(Ложь, ИмяТабличнойЧасти, ВключатьДопТарифы)
	
КонецФункции

// Помещает в переданный МенеджерВременныхТаблиц таблицу 
//	ВТКлассыУсловийТруда, которая содержит следующие поля:
//		Период - дата
//		КлассУсловийТруда - ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки
//		ВидыРаботСДосрочнойПенсией - ПеречислениеСсылка.ВидыРаботСДосрочнойПенсией
//
// Параметры:
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//
Процедура СоздатьВТКлассыУсловийТруда(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлассыПоДолжностям.Период,
	|	КлассыПоДолжностям.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА КлассыПоДолжностям.Должность ССЫЛКА Справочник.ШтатноеРасписание
	|			ТОГДА КлассыПоДолжностям.Должность.Должность.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией
	|		ИНАЧЕ КлассыПоДолжностям.Должность.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией
	|	КОНЕЦ КАК ВидыРаботСДосрочнойПенсией
	|ПОМЕСТИТЬ ВТКлассыУсловийТруда
	|ИЗ
	|	РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыПоДолжностям";
	
	Запрос.Выполнить();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УточнитьСторнируемыеДокументы(ТаблицаСторнируемыхДокументов, ТаблицаПромежуточныхИсправлений)
    
	СтрокиКУдалению = Новый Массив;
	Для каждого СтрокаТЗ Из ТаблицаСторнируемыхДокументов Цикл
	    Если Не ЗначениеЗаполнено(СтрокаТЗ.СторнируемыйДокумент) Тогда
			СтрокиКУдалению.Добавить(СтрокаТЗ)
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаТЗ Из СтрокиКУдалению Цикл
		ТаблицаСторнируемыхДокументов.Удалить(СтрокаТЗ)
	КонецЦикла;
	
	ОбработанныеДокументы = Новый Соответствие;	
	Для каждого СтрокаТЗ Из ТаблицаСторнируемыхДокументов Цикл
		УточненныйДокумент = ОбработанныеДокументы[СтрокаТЗ.СторнируемыйДокумент];
		Если ЗначениеЗаполнено(УточненныйДокумент) Тогда
			СтрокаТЗ.СторнируемыйДокумент = УточненныйДокумент
		Иначе
			Если СтрокаТЗ.СторнируемыйДокумент.Метаданные().Реквизиты.Найти("ИсправленныйДокумент") = Неопределено Тогда
				ОбработанныеДокументы.Вставить(СтрокаТЗ.СторнируемыйДокумент, СтрокаТЗ.СторнируемыйДокумент);
				Продолжить;
			КонецЕсли;
			ПредыдущаяСсылка = СтрокаТЗ.СторнируемыйДокумент;
			СледующаяСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредыдущаяСсылка, "ИсправленныйДокумент");
			НовыеСтроки = Новый Массив;
			Пока ЗначениеЗаполнено(СледующаяСсылка) Цикл
				СтрокаТаблицыПромежуточныхИсправлений = ТаблицаПромежуточныхИсправлений.Добавить();
				СтрокаТаблицыПромежуточныхИсправлений.ПромежуточноеИсправление = ПредыдущаяСсылка;
				НовыеСтроки.Добавить(СтрокаТаблицыПромежуточныхИсправлений);
				ПредыдущаяСсылка = СледующаяСсылка;
				Если ПредыдущаяСсылка.Метаданные().Реквизиты.Найти("ИсправленныйДокумент") = Неопределено Тогда
					Прервать;
				КонецЕсли;
				СледующаяСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредыдущаяСсылка, "ИсправленныйДокумент")
			КонецЦикла;
			ОбработанныеДокументы.Вставить(СтрокаТЗ.СторнируемыйДокумент, ПредыдущаяСсылка);
			СтрокаТЗ.СторнируемыйДокумент = ПредыдущаяСсылка;
			Для каждого СтрокаТаблицыПромежуточныхИсправлений Из НовыеСтроки Цикл
				СтрокаТаблицыПромежуточныхИсправлений.СторнируемыйДокумент = ПредыдущаяСсылка;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
